Revit 2024 API
DirectShape.RemoveReferenceObject Method
Overload List
Name | Description
RemoveReferenceObject(String)
 Removes any reference objects with the given name from the DirectShape. Nothing is done if no reference objects have the given name or if the name is the empty string.
RemoveReferenceObject(ExternalGeometryId)
 Removes any reference object associated with the provided ExternalGeometryId from the DirectShape. Nothing is done if no reference object has the given external ID or if the external ID is an empty string.
See Also
DirectShape Class
DirectShape Members
Autodesk.Revit.DB Namespace